# FamilyName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyLoadingIntoDocumentEventArgs..::..FamilyName Property
FamilyLoadingIntoDocumentEventArgs Class See Also
---
The file name of the family that is being loaded into the document.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string FamilyName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilyName As String
	Get
```

Visual C++
---
```text
public:
property String^ FamilyName {
	String^ get ();
}
```

# See Also
FamilyLoadingIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace